src/Catalogs/УведомленияПрограммы/УведомленияПрограммы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УведомленияПрограммы</name>
  <attributes>
    <name>ВидУведомления</name>
    <type>
      <types>EnumRef.ВидыУведомленийПрограммы</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектУведомления</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПояснениеОповещения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Просмотрено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОповещения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/УведомленияПрограммы/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("ВидУведомления");
	Поля.Добавить("Дата");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаПредставления = НСтр("ru = '%1 от %2'");
	
	СтрокаПредставления = СтрЗаменить(СтрокаПредставления, "%1", Данные.ВидУведомления);
	
	Представление = СтрЗаменить(СтрокаПредставления, "%2", Данные.Дата);
	
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет уведомление.
//
// Параметры:
//  ТемаУведомления     - Строка                                      - Текст уведомления, которая будет показана в списке уведомлений.
//  ТекстУведомления    - Строка                                      - Текст уведомления, который будет показан в карточке уведомлений.
//  ТекстОповещения     - Строка                                      - Текст уведомления, который будет показан в заголовке всплывающего оповещения.
//  ПояснениеОповещения - Строка                                      - Текст уведомления, который будет показан в пояснении всплывающего оповещения.
//  ВидУведомления      - ПеречислениеСсылка.ВидыУведомленийПрограммы - Вид уведомления.
//  Пользователь        - СправочникСсылка.Пользователи               - Получатель уведомления.
//  ПредметУведомления  - ОпределяемыйТип.ОбъектУведомления           - Предмет уведомления.
//
Процедура Добавить(ТемаУведомления, ТекстУведомления, 
	ТекстОповещения, ПояснениеОповещения, ВидУведомления, 
	Пользователь, ПредметУведомления) Экспорт
	
	НовоеУведомление = СоздатьЭлемент();
	
	НовоеУведомление.КраткоеОписание = ТемаУведомления;
	НовоеУведомление.Описание = ТекстУведомления;
	НовоеУведомление.ТекстОповещения = ТекстОповещения;
	НовоеУведомление.ПояснениеОповещения = ПояснениеОповещения;
	НовоеУведомление.ВидУведомления = ВидУведомления;
	НовоеУведомление.Пользователь = Пользователь;
	НовоеУведомление.Объект = ПредметУведомления;
	
	НовоеУведомление.Дата = ТекущаяДатаСеанса();
	
	НовоеУведомление.Записать();
	
КонецПроцедуры

// Получает количество уведомлений для текущего пользователя
//
// Возвращаемое значение:
//  Число - Количество уведомлений для текущего пользователя.
//
Функция ПолучитьУведомления() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УведомленияПрограммы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.УведомленияПрограммы КАК УведомленияПрограммы
		|ГДЕ
		|	УведомленияПрограммы.Пользователь = &Пользователь
		|	И УведомленияПрограммы.Просмотрено = ЛОЖЬ
		|	И УведомленияПрограммы.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Получает данные уведомлений для текущего пользователя
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Данные уведомлений.
//
Функция ДанныеУведомлений() Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	УведомленияПрограммы.Ссылка КАК Уведомление,
		|	УведомленияПрограммы.Объект КАК Предмет,
		|	УведомленияПрограммы.ТекстОповещения КАК ТекстОповещения,
		|	УведомленияПрограммы.ПояснениеОповещения КАК ПояснениеОповещения,
		|	УведомленияПрограммы.КраткоеОписание КАК КраткоеОписание,
		|	УведомленияПрограммы.Описание КАК Описание,
		|	УведомленияПрограммы.ВидУведомления КАК ВидУведомления
		|ИЗ
		|	Справочник.УведомленияПрограммы КАК УведомленияПрограммы
		|ГДЕ
		|	УведомленияПрограммы.Пользователь = &Пользователь
		|	И УведомленияПрограммы.Просмотрено = ЛОЖЬ
		|	И УведомленияПрограммы.ПометкаУдаления = ЛОЖЬ");
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	
	ДанныеУведомлений = Запрос.Выполнить().Выгрузить();
	Для Каждого ДанныеУведомления Из ДанныеУведомлений Цикл
		
		Если Не ЗначениеЗаполнено(ДанныеУведомления.ТекстОповещения) Тогда
			ДанныеУведомления.ТекстОповещения =
				?(ДанныеУведомления.ВидУведомления = Перечисления.ВидыУведомленийПрограммы.Ошибка,
					НСтр("ru = 'Уведомление об ошибке'"),
					НСтр("ru = 'Уведомление'"));
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ДанныеУведомления.ПояснениеОповещения) Тогда
			ДанныеУведомления.ПояснениеОповещения = ДанныеУведомления.КраткоеОписание;
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеУведомлений.Колонки.Удалить("КраткоеОписание");
	ДанныеУведомлений.Колонки.Удалить("Описание");
	
	Возврат ДанныеУведомлений;
	
КонецФункции

// Отмечает просмотр уведомления.
//
// Параметры:
//  УведомлениеПрограммы - СправочникСсылка.УведомленияПрограммы - Уведомление программы.
//
Процедура ОтметитьПросмотр(УведомлениеПрограммы) Экспорт
	
	УведомлениеПрограммыОбъект = УведомлениеПрограммы.ПолучитьОбъект();
	УведомлениеПрограммыОбъект.Просмотрено = Истина;
	УведомлениеПрограммыОбъект.Записать();
	
КонецПроцедуры

// Отмечает просмотр всех уведомлений.
//
Процедура ОтметитьПросмотрВсех() Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	УведомленияПрограммы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.УведомленияПрограммы КАК УведомленияПрограммы
		|ГДЕ
		|	УведомленияПрограммы.Пользователь = &Пользователь
		|	И УведомленияПрограммы.Просмотрено = ЛОЖЬ");
	
	Запрос.УстановитьПараметр("Пользователь", ПользователиКлиентСервер.ТекущийПользователь());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОтметитьПросмотр(Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
